
import { useParams } from "react-router-dom";

export const mockupData = [
    // {
    //     id:'page1',
    //     name:"ระบบตรวจจับการสั่นสะเทือนคอมเพลสเซอร์",
    //     image:"/images/%E0%B8%9C%E0%B8%A5%E0%B8%87%E0%B8%B2%E0%B8%991.png",
    //     except: "ระบบตรวจจับการสั่นสะเทือนคอมเพลสเซอร์ คือ ระบบตรวจจับการสั่นสะเทือนคอมเพลสเซอร์...",//ข้อความย่อย
    //     fullDetail1: "<h1>What is Lorem Ipsum?</h1> <br/>Lorem Ipsum is simply dummy text of the printing and typesetting industry.",
    //     fullDetail2:"",
    //     fullDetail3:"",
    //     path:'/detail/page1 '
    // },
    {
        id:'page1',
        name:"การจัดการกระบวนการผลิตด้วยเทคโนโลยีดิจิทัล (IOT & Embedded Technology) ภายใต้โครงการส่งเสริมและสนับสนุนการประยุกต์ใช้เทคโนโลยีดิจิทัล (ปีงบประมาณ 2564)",
        image:"/images/P11.png",
        image2:"/images/P12.png",
        except: "การติดตั้งระบบม่านอากาศอัตโนมัติที่ประตูเข้าออก บริษัท ทะเลทรัพย์ฟรีซดราย จำกัด",
        fullDetail1: "<h1>ดำเนินการออกแบบพัฒนาและติดตั้งEnergy meterเพื่อวิเคราะห์ค่าไฟฟ้าต่อวันเปรียบเทียบกับกำลังการผลิตต่อวันให้แก่ บริษัท เอ.เอ็น.ซี.รีไซเคิล อินดัสตรี้จำกัด</h1>",
        fullDetail2:"<h1>ดำเนินการออกแบบพัฒนาและติดตั้งEnergy meterเพื่อวิเคราะห์ค่าไฟฟ้าต่อวันเปรียบเทียบกับกำลังการผลิตต่อวันให้แก่ บริษัท ดิสโก้โปรดักส์ ฟู้ดส์ จำกัด</h1>",
        fullDetail3:"",
        path:'/detail/page1'
    
    },
    {
        id:'page2',
        name:"โครงการเพิ่มประสิทธิภาพและผลิตภาพด้วยเทคโนโลยีและนวัตกรรมระบบอัจฉริยะเฝ้าติดตามและตรวจสอบดูแลการทำงานของเครื่องจักร (Machine Monitoring System)",
        image:"/images/P2.png",
        except: "โครงการเพิ่มประสิทธิภาพและผลิตภาพด้วยเทคโนโลยีและนวัตกรรมระบบอัจฉริยะเฝ้าติดตามและตรวจสอบดูแลการทำงานของเครื่องจักร (Machine Monitoring System)",
        fullDetail1: "<h1>Machine Monitoring System</h1> <br/>   ผู้รับจ้างได้มีส่วนร่วมในการดำเนินการติดตั้งระบบอัจฉริยะเฝ้าติดตามและตรวจสอบดูแลการทำงานของเครื่องจักรที่ใช้ในการดำเนินงานประกอบด้วยส่วนสำคัญ 5 ส่วนได้แก่อุปกรณ์เซนเซอร์, โมดูล Sensor Interface , โมดูล Sensor DataCollector, โมดูล PSU-MMS-IoT Module และ โมดูล 3G/4G Internet<br/>เมื่อสัญญาณส่งมายังมหาวิทยาลัยสงขลานครินทร์แล้ว จะมีการจัดเก็บเป็นระบบ โดยแยกประเภทและแยกเป็นรายกิจการข้อมูลจะถูกส่งต่อและจัดเก็บไว้เพื่อทำการรวบรวมรอการวิเคราะห์ต่อไป ชิ้นส่วนอุปกรณ์ในองค์ประกอบที่ 2 ถึง 5จะถูกบรรจุไว้ในกล่อง ส่วนเซนเซอร์ (องค์ประกอบที่ 1) จะถูกติดตั้งตามจุดต่าง ๆ ที่กำหนด ทั้งนี้ในแต่ละสถานประกอบการจะมีการใช้เซนเซอร์ต่างชนิดกันไปตามความจำเป็นและข้อมูลที่ต้องการตรวจวัดและจัดเก็บเพื่อติดตามประเมินผลการทำงานของเครื่องจักร หรือพนักงาน แล้วแต่กรณี",
        fullDetail2:"",
        fullDetail3:"",
        path:'/detail/page2'
    
    },
    {
        id:'page3',
        name:"โครงการยกระดับและเพิ่มศักยภาพอุตสาหกรรมท่องเที่ยวและอุตสาหกรรมที่เกี่ยวเนื่องเชิงสุขภาพ",
        image:"/images/P3.png",
        except: "โครงการยกระดับและเพิ่มศักยภาพอุตสาหกรรมท่องเที่ยวและอุตสาหกรรมที่เกี่ยวเนื่องเชิงสุขภาพ",
        fullDetail1: "<h1></h1> <br/>จากการดำเนินโครงการดังกล่าว ทางผู้รับจ้างได้มีส่วนร่วมในการดำเนินการติดตั้งระบบฆ่าเชื้อด้วยรังสี UV-C , ระบบอัตโนมัติรควบคุมการทำงานเครื่องสาวไหม, ระบบติดตามการใช้ไฟฟ้าแบบออนไลน์และเครื่องพอกไข่เค็ม",
        fullDetail2:"",
        fullDetail3:"",
        path:'/detail/page3'
    
    },
    {
        id:'page4',
        name:"กิจกรรมการพัฒนาเทคโนโลยีเกษตรอุตสาหกรรมอัจฉริยะ ภายใต้โครงการส่งเสริมเกษตรอุตสาหกรรมแบบครบวงจร ปีงบประมาณ 2564",
        image:"/images/P4.png",
        image2:"/images/P5.png",
        image3:"/images/P6.png",
        image4:"/images/P7.png",
        image5:"/images/P8.png",
        except: "กิจกรรมการพัฒนาเทคโนโลยีเกษตรอุตสาหกรรมอัจฉริยะ ภายใต้โครงการส่งเสริมเกษตรอุตสาหกรรมแบบครบวงจร ปีงบประมาณ 2564",
        fullDetail1: "กลุ่มวิสาหกิจชุมชนข้าวปลอดสารและเลี้ยงแพะอำเภอเชียรใหญ่ (เครื่องสีข้าวอัจฉริยะ)",
        fullDetail2:"กลุ่มวิสาหกิจชุมชนผู้เลี้ยงโคบ้านศาลาตะเคียน (ระบบชั่งน้ำหนักโคอัจฉริยะ)",
        fullDetail3:" วิสาหกิจชุมชนเพาะเห็ดนาบอน (ระบบควบคุมอุณหภูมิและความชื้นภายในโรงเปิดดอกเห็ดอัจฉริยะ)",
        fullDetail4:" วิสาหกิจชุมชนกลุ่มผึ้งโพรงไทยตำบลสระแก้ว (ตู้อบไล่ความชื้นในน้ำผึ้งอัจฉริยะ)",
        fullDetail5:"  วิสาหกิจชุมชนพัฒนาเกษตรอินทรีย์(รังผึ้งอัจฉริยะ)",
        path:'/detail/page4'
    
    },
    {
        id:'page5',
        name:"กิจกรรมยกระดับสถานประกอบการด้วยเทคโนโลยี3 Stage Rocket 17.1-1 การปฏิรูปอุตสาหกรรมศักยภาพสู่อุตสาหกรรมเพิ่มมูลค่า (ปีงบประมาณ 2564)",
        image:"/images/P9.png",
        image2:"/images/P10.png",
        except: "ออกแบบ พัฒนาและติดตั้งระบบควบคุมอุณหภูมิน้ำมันในกระบวนการทอด บริษัท นาราสมุทรจำกัด โดยการติดตั้งเซนเซอร์วัดอุณหภูมิ จำนวน 8 ชุด โดยระบบสามารถ Monitor อุณหภูมิน้ำมันได้แบบเรียลไทม์",
        fullDetail2: "ออกแบบ พัฒนาและติดตั้งระบบควบคุมอุณหภูมิน้ำมันในกระบวนการทอด บริษัท นาราสมุทรจำกัด โดยการติดตั้งเซนเซอร์วัดอุณหภูมิ จำนวน 8 ชุด โดยระบบสามารถ Monitor อุณหภูมิน้ำมันได้แบบเรียลไทม์ สามารถดูข้อมูลอุณภูมิจากมือถือ สามารถจัดเก็บข้อมูลและเรียกดูข้อมูลย้อนหลังได้ ",
        fullDetail1:" <h1> ข้อมูลก่อนการติดตั้งระบบควบคุมอุณหภูมิน้ำมันในกระบวนการทอด</h1> <br/>การวัดอุณหภูมิน้ำมันในกระทะแบบเดิม คือ ฝ่าย QC ต้องใช้ทอร์โมมิเตอร์ในการวัด ซึ่งทำให้ฝ่าย QCต้องเดินเข้าไลน์การผลิตในทุก ๆ 30 นาที ต้องตรวจสอบอุณหภูมิการทอดของแต่ละกระทะ ส่งผลให้เกิดความล่าช้า ทำให้อุณหภูมิน้ำมันในการทอดบางกระทะสูงเกินไป ส่งผลทำให้ข้าวเกรียบไหม้และเกิดของเสีย โดยของเสียที่เกิดขึ้นประมาณ 5 กิโลกรัม/วัน หรือคิดเป็นจำนวนเงิน 270 บาท/วัน",
        fullDetail3:" <h1>ข้อมูลหลังการติดตั้งระบบควบคุมอุณหภูมิน้ำมันในกระบวนการทอด</h1>  หลังจากมีการติดตั้งระบบควบคุมอุณหภูมิน้ำมันในกระบวนการทอด ส่งผลดีต่อการทำงานเป็นอย่าง มาก ฝ่าย QC สามารถตรวจสอบอุณหภูมิได้ในทันที และสามารถตรวจสอบอุณหภูมิในการทอดของแต่ละกระทะได้พร้อมกัน อีกทั้งยังสามารถดูข้อมูลอุณหภูมิย้อนหลังได้ ของเสียที่เกิดขึ้นจะอยู่ที่ 2 กิโลกรัม/วัน หรือคิดเป็นจำนวนเงิน 108 บาท/วน",
        path:'/detail/page5'
    
    },
    {
        id:'page6',
        name:"โครงการเพิ่มผลิตภาพสถานประกอบการด้วยเทคโนโลยีอัตโนมัติ",
        image:"/images/P16.png",
        except: "โครงการเพิ่มผลิตภาพสถานประกอบการด้วยเทคโนโลยีอัตโนมัติ",
        fullDetail1: "1) บริษัท ทะเลทรัพย์ฟรีซดราย จำกัด -ติดตั้งระบบม่านอากาศอัตโนมัติที่ประตูเข้าออกห้องเก็บวัตถุดิบ<br/>2)บริษัท แฮปปี้ ทูบีเฮลท์ จำกัด -ติดตั้งระบบควบคุมอุณหภูมิน้ำมันเพื่อควบคุมการจ่ายแก๊สที่สามารถตั้งเวลาได้<br/>3)บริษัท สวนทวีทรัพย์ฟู้ด จำกัด -ติดตั้งระบบม่านอากาศอัตโนมัติที่ประตูห้องเก็บวัตถุดิบ<br/>4)บริษัท ศรีสุดา เบเกอรี่จำกัด -ติดตั้งระบบควบคุมอุณหภูมิในห้องหมัก .",
        fullDetail2:"",
        fullDetail3:"",
        path:'/detail/page6'
    
    },
    {
        id:'page7', 
        name:"พัฒนาการบริหารจัดการองค์กรด้วยเทคโนโลยีนวัตกรรมและระบบอัตโนมัติหรือดิจิทัลภายใต้โครงการยกระดับและเพิ่มศักยภาพอุตสาหกรรมท่องเที่ยวและอุตสาหกรรมที่เกี่ยวเนื่องเชิงสุขภาพจังหวัดนครศรีธรรมราช",
        image:"/images/P17.png",
        except: "กิจกรรมพัฒนาการบริหารจัดการองค์กรด้วยเทคโนโลยีนวัตกรรมและระบบอัตโนมัติหรือดิจิทัลภายใต้โครงการยกระดับและเพิ่มศักยภาพอุตสาหกรรมท่องเที่ยวและอุตสาหกรรมที่เกี่ยวเนื่องเชิงสุขภาพจังหวัดนครศรีธรรมราช (ปีงบประมาณ 2564)",
        fullDetail1: "- บริษัท ปาล์มพันล้านจำกัด -พัฒนาการปรับความเร็วรอบมอเตอร์ที่ใช้ในการดูดแยก Fiber กับ Nut <br/> - บริษัท เดอะอินดี้สไตล์จำกัด -พัฒนาการประยุกต์ใช้เครื่องปั๊มไฮโดรลิคหน้าผ้า <br/>- หจก.สุชาโตโรงงานปลาป่น -ติดตั้ง Load Cell สำหรับตรวจวัดน้ำหนักกระสอบและการบันทึกข้อมูลอัตโนมัติ<br/> - บริษัท เจริญพาณิช 59 จำกัด -พัฒนาการบรรจุน้ำลงขวดใหญ่/ถังขาวขุ่น<br/> - บริษัท ตรังแคนเนอรี่จำกัด -ติดตั้งระบบเติมจารบีอัตโนมัติของเครื่องตัดแผ่นเหล็ก",
        fullDetail2:"",
        fullDetail3:"",
        path:'/detail/7'
    
    },

]
// http://localhost:3000/images/GG7.png
//fullDetail2:""",
//fullDetail3:""",
//fullDetail4:""",
//fullDetail5:""",
//fullDetail6:""",
